// var skills = [
//     {
// 	"type": "身体的パワー",
// 	"subtype": [
// 	    "わんぱくさ",
// 	    "正義感",
// 	    "母性"
// 	]
//     }
//     ,
//     {
// 	"type": "社会的パワー",
// 	"subtype": [
// 	    "かしこさ",
// 	    "金の力",
// 	    "安定力"
// 	]
//     }
//     ,
//     {
// 	"type": "精神的パワー",
// 	"subtype": [
// 	    "清めの力",
// 	    "霊感",
// 	    "感受性"
// 	]
//     }
// ];

var skills = {
    "身体的パワー": [
	"わんぱくさ",
	"正義感",
	"母性"
    ]
    ,
    "社会的パワー": [
	"かしこさ",
	"金の力",
	"安定力"
    ]
    ,
    "精神的パワー": [
	"清めの力",
	"霊感",
	"感受性"
    ]
};

var place2skill = {
    "公園": "身体的パワー",
    "交番": "身体的パワー",
    "保育園": "身体的パワー",
    "幼稚園": "身体的パワー",

    "図書館": "社会的パワー",
    "小学校": "社会的パワー",
    "中学校": "社会的パワー",
    "高等学校": "社会的パワー",
    "専門学校": "社会的パワー",
    "短期大学・大学": "社会的パワー",
    "銀行": "社会的パワー",
    "市役所・町村役場": "社会的パワー",
    "区役所": "社会的パワー",
    "職業安定所": "社会的パワー",

    "公衆便所": "精神的パワー",
    "ごみ処理施設": "精神的パワー",
    "神社": "精神的パワー",
    "寺院": "精神的パワー",
    "博物館・資料館": "精神的パワー",
    "美術館": "精神的パワー"
};



var places = [];

交番119
公園154　

番号は大阪市のデータのアイコン番号

体力

正義感

交番119

わんぱく

公園154　

母性

幼稚園125　保育園124



社会

賢さ

図書館151　小学校126　中学校127 高等学校128　専門学校129 　短期大学・大学130

金の力

銀行203　

安定感

市役所・町村役場100　区役所101　職業安定所111


