var categories = [
    "身体的パワー": {
	"わんぱくさ":
    },
    "社会的パワー": {},
    "精神的パワー": {}
];


var id2place = function(id) {
    var data = {
	"154": "公園",
	"119": "交番",
	"124": "保育園",
	"125": "幼稚園",
	"151": "図書館",

	"126": "小学校",
	"127": "中学校",
	"128": "高等学校",
	"129": "専門学校",
	"130": "短期大学・大学",

	"203": "銀行",
	"100": "市役所・町村役場",
	"101": "区役所",
	"111": "職業安定所",
	"169": "公衆便所",
	"114": "ごみ処理施設",
	"147": "神社",
	"148": "寺院",
	"150": "博物館・資料館",
	"152": "美術館"
    };

    return data[String(id)];
};


var place2subcategory = function(place) {
    var data = {
	"公園": "わんぱくさ",
	"交番": "正義感",
	"保育園": "母性",
	"幼稚園": "母性",

	"図書館": "かしこさ",
	"小学校": "かしこさ",
	"中学校": "かしこさ",
	"高等学校": "かしこさ",
	"専門学校": "かしこさ",
	"短期大学・大学": "かしこさ",

	"203": "銀行",
	"100": "市役所・町村役場",
	"101": "区役所",
	"111": "職業安定所",
	"169": "公衆便所",
	"114": "ごみ処理施設",
	"147": "神社",
	"148": "寺院",
	"150": "博物館・資料館",
	"152": "美術館"
    }
};
